// Fill out your copyright notice in the Description page of Project Settings.

#pragma once

#include "CoreMinimal.h"
#include "Animation/AnimationAsset.h"
#include "Engine/Public/Respawn/Streaming/RsStreamingDefinition.h"
#include "StructsAndEnums_RsGameTechRT.generated.h"

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum RsGameTechRT.ERsAttackSwingDirection
UENUM(BlueprintType) enum ERsAttackSwingDirection
{
	None = 0,
	Left = 1,
	Right = 2,
	Up = 3,
	Down = 4,
	Forward_ERsAttackSwingDirection = 5,
	Low = 6,
	High = 7,
	NumSwingDirections = 8,
	ERsAttackSwingDirection_MAX = 9
};


// Enum RsGameTechRT.ERsAttackerDirection
UENUM(BlueprintType) enum ERsAttackerDirection
{
	None_ERsAttackerDirection = 0,
	Front = 1,
	Left_ERsAttackerDirection = 2,
	Right_ERsAttackerDirection = 3,
	Back = 4,
	ERsAttackerDirection_MAX = 5
};


// Enum RsGameTechRT.ERsCharacterReaction
UENUM(BlueprintType) enum ERsCharacterReaction
{
	Unknown = 0,
	None_ERsCharacterReaction = 1,
	Default_ERsCharacterReaction = 2,
	Flinch = 3,
	Stagger = 4,
	Kneel = 5,
	Flatten = 6,
	Launch = 7,
	Flyback = 8,
	Sweep = 9,
	Spin = 10,
	Stunned = 11,
	Impale = 12,
	Block = 13,
	BlockWeakened = 14,
	AttackBlocked = 15,
	WallCollision = 16,
	Kicked = 17,
	BlockBreak = 18,
	PreStaggerDodge = 19,
	Stagger_Light = 20,
	AttackParried = 21,
	AttackCountered = 22,
	Flop = 23,
	Slide = 24,

	Disabled_ERsWallPressState = 0,
	ActiveSeek_ERsWallPressState = 1,
	Attached_ERsWallPressState = 2,
	ConstrainedMovement_ERsWallPressState = 3,
	Entry_ERsWallPressState = 4,
	Exit_ERsWallPressState = 5,
	InPlaceJump = 6,
	JumpOff = 7,
	TransitioningIn_ERsWallPressState = 8,
	TransitioningOut_ERsWallPressState = 9,
	ERsWallPressState_MAX = 10
};


// Enum RsGameTechRT.ERsWallPressMovementType
UENUM(BlueprintType) enum ERsWallPressMovementType
{
	MOVEMENT_SIDLE = 0,
	MOVEMENT_WALL_JUMP = 1,
	MOVEMENT_COUNT = 2,
	MOVEMENT_MAX = 3
};


// Enum RsGameTechRT.ERsWallPressMovementDirection
UENUM(BlueprintType) enum ERsWallPressMovementDirection
{
	DIRECTION_NONE_ERsWallPressMovementDirection = 0,
	DIRECTION_LEFT_ERsWallPressMovementDirection = 1,
	DIRECTION_RIGHT_ERsWallPressMovementDirection = 2,
	DIRECTION_MAX_ERsWallPressMovementDirection = 3
};


// Enum RsGameTechRT.ERsWallPressMovementTarget
UENUM(BlueprintType) enum ERsWallPressMovementTarget
{
	Horizontal = 0,
	Count = 1,
	ERsWallPressMovementTarget_MAX = 2
};


// Enum RsGameTechRT.ERsWorldMapStreamingArea
UENUM(BlueprintType) enum ERsWorldMapStreamingArea
{
	Visual = 0,
	All = 1,
	ERsWorldMapStreamingArea_MAX = 2
};


// Enum RsGameTechRT.ERsWorldMapDoorType
UENUM(BlueprintType) enum ERsWorldMapDoorType
{
	StandardDoor = 0,
	ForceDoor = 1,
	ERsWorldMapDoorType_MAX = 2
};


// Enum RsGameTechRT.ERsHolomapMode
UENUM(BlueprintType) enum ERsHolomapMode
{
	Roaming = 0,
	HoloTable_NonInteractive = 1,
	HoloTable_Interactive = 2,
	Cinematic_ERsHolomapMode = 3,
	ERsHolomapMode_MAX = 4
};


// Enum RsGameTechRT.ERsZiplinePhysicalAnimationProfile
UENUM(BlueprintType) enum ERsZiplinePhysicalAnimationProfile
{
	None_ERsZiplinePhysicalAnimationProfile = 0,
	Default_ERsZiplinePhysicalAnimationProfile = 1,
	ERsZiplinePhysicalAnimationProfile_MAX = 2
};


// Enum RsGameTechRT.ERsZiplineAttachmentSegment
UENUM(BlueprintType) enum ERsZiplineAttachmentSegment
{
	TopSegment = 0,
	MiddleSegment = 1,
	BottomSegment = 2,
	ERsZiplineAttachmentSegment_MAX = 3
};


// Enum RsGameTechRT.ERsZiplineMovementDirection
UENUM(BlueprintType) enum ERsZiplineMovementDirection
{
	Descending = 0,
	Ascending = 1,
	NoMovement = 2,
	ERsZiplineMovementDirection_MAX = 3
};


// Enum RsGameTechRT.ERsZiplineEntryType
UENUM(BlueprintType) enum ERsZiplineEntryType
{
	NoEntry = 0,
	Air_ERsZiplineEntryType = 1,
	Ground_ERsZiplineEntryType = 2,
	ERsZiplineEntryType_MAX = 3
};


// Enum RsGameTechRT.ERsZiplineAnimationState
UENUM(BlueprintType) enum ERsZiplineAnimationState
{
	NotAttached = 0,
	Entering = 1,
	AttachedIdle = 2,
	AttachedPreJump = 3,
	ERsZiplineAnimationState_MAX = 4
};


// Enum RsGameTechRT.ERsZiplineAttachmentState
UENUM(BlueprintType) enum ERsZiplineAttachmentState
{
	Disabled_ERsZiplineAttachmentState = 0,
	ActiveSeek_ERsZiplineAttachmentState = 1,
	Entry_ERsZiplineAttachmentState = 2,
	Movement = 3,
	ERsZiplineAttachmentState_MAX = 4
};

// ScriptStruct RsGameTechRT.RsPhysicalAnimationRuntimeProfileParameters
// 0x0010
USTRUCT(BlueprintType)
struct FRsPhysicalAnimationRuntimeProfileParameters
{
	GENERATED_BODY()
public:
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsPhysicalAnimationRuntimeProfileParameters")
	float                                              ActivationDelayTime;                                      // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsPhysicalAnimationRuntimeProfileParameters")
	float                                              FadeInTime;                                               // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsPhysicalAnimationRuntimeProfileParameters")
	float                                              FadeOutTime;                                              // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsPhysicalAnimationRuntimeProfileParameters")
	bool                                               StopAnyPreviousPhysicalAnimation;                         // 0x000C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct RsGameTechRT.RsPhysicalAnimationParameters
// 0x0160
USTRUCT(BlueprintType)
struct FRsPhysicalAnimationParameters
{
	GENERATED_BODY()
public:
	bool                                               DoNotActivate;                                            // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	//unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	FName                                       ProfileName;                                              // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	//FRsPhysicalAnimationBoneParameters          DefaultBone;                                              // 0x0010(0x0068) (Edit)
	//FRsPhysicalAnimationBoneParameters          RootBoneBody;                                             // 0x0078(0x0068) (Edit)
	//TArray<FRsPhysicalAnimationBoneParameters>  BonesOverride;                                            // 0x00E0(0x0010) (Edit, ZeroConstructor)
	//TArray<FRsPhysicalAnimationJointAngularParameters> JointsAngularOverride;                                    // 0x00F0(0x0010) (Edit, ZeroConstructor)
	//TArray<FRsPhysicalAnimationJointLinearParameters> JointsLinearOverride;                                     // 0x0100(0x0010) (Edit, ZeroConstructor)
	float                                              MaximumLinearVelocity;                                    // 0x0110(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaximumAngularVelocity;                                   // 0x0114(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinimumPhysicsBlendWeightFromAnimationNotifies;           // 0x0118(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MaximumPhysicsBlendWeightFromAnimationNotifies;           // 0x011C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OverrideBlendTimeForPhysicsBlendWeightFromAnimationNotifies;// 0x0120(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OverrideProjectionLinearThreshold;                        // 0x0124(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int8_t                                             OverrideProjectionActivation;                             // 0x0128(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EFRsPhysicalAnimationBlendingCustomController      blendingCustomController;                                 // 0x0129(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	//FRsPhysicalAnimationBlendingCustomControllerParameters BlendingCustomControllerParameters;                       // 0x012A(0x0001) (Edit)
	EFRsPhysicalAnimationCustomBlendInPhysics          CustomBlendInPhysics;                                     // 0x012B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ProfilePriority;                                          // 0x012C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UpdateActorWorldPositionFromPhysics : 1;                  // 0x012D(0x0001) (Edit)
	unsigned char                                      UseRsDominanceGroupFromOwnerKineticActor : 1;             // 0x012D(0x0001) (Edit)
	unsigned char                                      EnableRagdollCollisionProfile : 1;                        // 0x012D(0x0001) (Edit)
	unsigned char                                      EnableHardcodedCollisionSettings : 1;                     // 0x012D(0x0001) (Edit)
	unsigned char                                      ApplyRootMotion : 1;                                      // 0x012D(0x0001) (Edit)
	unsigned char                                      ZeroRsPhysicsVelocity : 1;                                // 0x012D(0x0001) (Edit)
	unsigned char                                      ConfigureCollisionSettingsForCharacterWeapons : 1;        // 0x012D(0x0001) (Edit)
	unsigned char                                      ModifyPhysicsAssetCollisionsToIncludeWeapons : 1;         // 0x012D(0x0001) (Edit)
	unsigned char                                      SetupRagdollSoundEvents : 1;                              // 0x012E(0x0001) (Edit)
	unsigned char                                      DoNotForceDependentComponentsToPostPhysics : 1;           // 0x012E(0x0001) (Edit)
	unsigned char                                      UseExclusivePhysicsScene : 1;                             // 0x012E(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x1];                                       // 0x012F(0x0001) MISSED OFFSET
	//FRsPhysicalAnimationTimeUpdateSchemeParameters TimeUpdateScheme;                                         // 0x0130(0x0008) (Edit)
	float                                              OverrideDeltaTimeForSmoothVelocity;                       // 0x0138(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x013C(0x0004) MISSED OFFSET
	//UPhysicalMaterial                           PhysicalMaterialOverride;                                 // 0x0140(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	//URsPhysicalAnimationMotorsDriveProfile*      MotorsDriveProfile;                                       // 0x0148(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	//TArray<FRsPhysicalAnimationMotorsStrengthModifier> MotorsStrengthModifiers;                                  // 0x0150(0x0010) (Edit, ZeroConstructor)
};

USTRUCT(BlueprintType)
struct FDismembermentConfiguration
{
	GENERATED_BODY()
public:

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FDismembermentConfiguration")
		FName MeshComponentName;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FDismembermentConfiguration")
		TWeakObjectPtr<USkinnedMeshComponent> SkinnedMeshComponent;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FDismembermentConfiguration")
		bool bChangeToRagdoll;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FDismembermentConfiguration")
		bool bApplyRadialImpulse;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FDismembermentConfiguration")
		FVector ImpulseDirection;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FDismembermentConfiguration")
		float ImpulseStrength;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FDismembermentConfiguration")
		UAnimationAsset *AnimationToPlay;
};

USTRUCT(BlueprintType)
struct FRsHitPause
{
	GENERATED_BODY()
public:

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitPause")
	TEnumAsByte<ERsHitPauseType> HitPauseType;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitPause")
	float Duration;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitPause")
	float AnimRate;
};

USTRUCT(BlueprintType)
struct FRsHitImpulse
{
	GENERATED_BODY()
public:

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitImpulse")
	int HitImpulseType;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitImpulse")
	float Duration;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitImpulse")
	float Distance;
};

USTRUCT(BlueprintType)
struct FRsHitEvent
{
	GENERATED_BODY()
public:

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	UClass* DamageTypeClass;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	FName AttackType;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	float HeroDamageFactor;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	TEnumAsByte <ERsDamageValueLevel> DamageLevel;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	TEnumAsByte <ERsBlockDepleteLevel> BlockDepleteLevel;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	TEnumAsByte <ERsBlockLevel> BlockLevel;
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	float BlockReactAngleCos;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	bool Undodgeable;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	bool Unparryable;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	bool SingleHit;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	bool NoDamageInSlowdown;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	bool DamageFriendlies;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	FRsHitPause HitPause;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	FRsHitImpulse HitImpulse;

	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsHitEvent")
	int UniqueHitID;
};

USTRUCT(BlueprintType)
struct FRsComponentRecord
{
	GENERATED_BODY()
public:
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsComponentRecord")
	FName                                       Class;                                                    // 0x0000(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsComponentRecord")
	FString                                      UniqueIdentifier;                                         // 0x0008(0x0010) (ZeroConstructor, SaveGame)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsComponentRecord")
	TArray<UObject*>                              ComponentData;                                            // 0x0018(0x0010) (ZeroConstructor, SaveGame)
};

USTRUCT(BlueprintType)
struct FRsActorRecord
{
	GENERATED_BODY()
public:
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	FName                                       Class;                                                    // 0x0000(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	FTransform                                  Transform;                                                // 0x0010(0x0030) (SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	FString                                      UniqueIdentifier;                                         // 0x0040(0x0010) (ZeroConstructor, SaveGame)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	TArray<UObject*>                              ActorData;                                                // 0x0050(0x0010) (ZeroConstructor, SaveGame)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	TArray<FRsComponentRecord>                  SerializedComponents;                                     // 0x0060(0x0010) (ZeroConstructor, SaveGame)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	TMap<FName, FString>                  PropertyOverrides;                                        // 0x0070(0x0050) (ZeroConstructor, SaveGame)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	bool                                               bTransformSet;                                            // 0x00C0(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData)
};

USTRUCT(BlueprintType)
struct FRsPlayerStartRecord
{
	GENERATED_BODY()
public:
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	FName                                       PlayerStartName;                                          // 0x0000(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	FName                                       PlanetName;                                               // 0x0008(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	URsStreamingDefinition*                      RootStreamingLevelDefinition;                             // 0x0010(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	FSoftObjectPath                             RootStreamingDefinitionPath;                              // 0x0018(0x0018) (ZeroConstructor, SaveGame)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	FTransform                                  PlayerStartTransform;                                     // 0x0030(0x0030) (SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsActorRecord")
	TArray<FRsStreamingAreaRef>                 StreamingAreas;                                           // 0x0060(0x0010) (ZeroConstructor, SaveGame)
};

USTRUCT(BlueprintType)
struct FRsSaveGameMetaData
{
	GENERATED_BODY()
public:
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameMetaData")
	FString                                      PlanetRegion;                                             // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameMetaData")
	int                                                Difficulty;                                               // 0x0010(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameMetaData")
	FDateTime                                   ElapsedPlayTime;                                          // 0x0018(0x0008) (BlueprintVisible, ZeroConstructor)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameMetaData")
	float                                              PercentComplete;                                          // 0x0020(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameMetaData")
	bool                                               bMainStoryComplete;                                       // 0x0024(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameMetaData")
	bool                                               bIsNewGamePlus;                                           // 0x0025(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

USTRUCT(BlueprintType)
struct FRsSaveGameInfo
{
	GENERATED_BODY()
public:
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	FString                                      SaveName;                                                 // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	FName                                       PlanetName;                                               // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	TWeakObjectPtr<URsStreamingDefinition>       StreamingDefinition;                                      // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	FSoftObjectPath                             StreamingDefinitionPath;                                  // 0x0020(0x0018) (ZeroConstructor)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	FName                                       StreamingPlayerStartName;                                 // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	FDateTime                                   TimeSaved;                                                // 0x0040(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	FText                                       TimeSavedText;                                            // 0x0048(0x0028) (BlueprintVisible, BlueprintReadOnly)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	/*Int I think, will test later*/ int                                     SaveSlot;                                                 // 0x0060(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	int                                                Changelist;                                               // 0x0064(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	bool                                               bCorrupt;                                                 // 0x0068(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsSaveGameInfo")
	FRsSaveGameMetaData                         MetaData;                                                 // 0x0070(0x0028) (BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Engine.RespawnInstanceDataBlueprintRef
// 0x0010
struct FRespawnInstanceDataBlueprintRef
{
	class AActor*                                      InstanceDataOwner;                                        // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                InstanceDataUID;                                          // 0x0008(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

struct FRsAISpawnerRef : public FRespawnInstanceDataBlueprintRef
{

};

USTRUCT(BlueprintType)
struct FRsMapSectionTag
{
	GENERATED_BODY()
public:
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsMapSectionTag")
	FName                                       WorldName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsMapSectionTag")
	FName                                       RegionName;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData)
	
	UPROPERTY(EditAnywhere, BlueprintReadWrite, Category = "FRsMapSectionTag")
	int                                      SectionIndex;                                             // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData)
};